{
  "Metadata": {
    "title": "Jan Zdeněk",
    "description": "Ambiciózní frontendový vývojář s citem pro detail, silnými analytickými schopnostmi a zkušenostmi s vedením týmu."
  },
  "Aside": {
    "name": "Jan Zdeněk",
    "position": "Frontend vývojář",
    "quote": "Vytvářím přístupná, na pixel přesná frontendová řešení pro web a webové aplikace."
  },
  "Main": {
    "About": {
      "title": "O mně",
      "content": "Jsem ambiciózní frontendový vývojář s citem pro detail, silnými analytickými schopnostmi a zkušenostmi s vedením týmu. Jsem kariérně orientovaný a zaměřený na výsledky, vždy usiluji o to, aby moje práce měla skutečný dopad a byla široce využívána.<br></br>Během své kariéry jsem měl možnost vyvíjet software v různých prostředích – od společností specializujících se na vývoj webových aplikací na míru až po velké korporace využívající proprietární frameworky.<br></br>Kromě práce je pro mě klíčové také vzdělání. Jako student Unicorn University jsem úspěšně absolvoval předměty jako Architektura cloudových aplikací, Frontendové a backendové systémy či Matematická analýza a diskrétní matematika.<br></br>Ve volném čase se věnuji rozvoji svých frontendových a backendových dovedností, hudbě a hraní videoher.",
      "href": "o-mne"
    },
    "Experience": {
      "title": "Zkušenosti",
      "href": "zkusenosti",
      "tabs": [
        {
          "title":"Frontend vývojář • Yolk Studio",
          "dateSpan": "Únor – Současnost",
          "description": "Vytvářel responzivní weby s úchvatnými 3D animacemi, vícejazyčnými server-side překlade a bezproblémovou kompatibilitou napříč prohlížeči.",
          "skills": ["Next.js", "React", "GraphQL", "TypeScript", "TailwindCSS"]
        },
        {
          "title":"Vývojář webových aplikací • eppTec",
          "dateSpan": "Září 2024 – Únor 2025",
          "description": "Vytvářel frontendová řešení pro bankovní procesy v České spořitelně a převáděl složité požadavky do funkčních, škálovatelných a responzivních systémů.",
          "skills": ["TypeScript", "Analytické myšlení", "Bankovní procesy"]
        },
        {
          "title":"Frontend vývojář • ka.soft",
          "dateSpan": "Červen – Září 2024 • ka.soft",
          "description": "Vedl jsem návrh a vývoj zakázkových webových aplikací s důrazem na intuitivní UX/UI, responzivní frontend a bezproblémovou integraci s backendem. Řídil jsem celý vývojový cyklus a zajišťoval včasné dodání škálovatelných a přístupných řešení dle požadavků klientů.",
          "skills": ["React", "TypeScript", "TailwindCSS", "Vite"]
        }
      ],
      "link": {
        "title": "Získat životopis",
        "href": "/janZdenek_zivotopis.pdf"
      }
    },
    "Projects": {
      "title": "Projekty",
      "content": "",
      "href": "projekty"
    }
  }
}