{
  "Aside": {
    "name": "Jan Zdeněk",
    "position": "Frontend vývojář",
    "quote": "Vytvářím přístupná, na pixel přesná frontendová řešení pro web a webové aplikace."
  },
  "Main": {
    "About": {
      "title": "O mně",
      "content": "Jsem ambiciózní frontendový vývojář s citem pro detail, silnými analytickými schopnostmi a zkušenostmi s vedením týmu. Jsem kariérně orientovaný a zaměřený na výsledky, s velkou vášní pro skutečný dopad a využití mé práce.<br></br>V minulosti jsem měl možnost vyvíjet software napříč širokou škálou prostředí – od firem poskytujících webové aplikace a stránky na míru po velké korporáty vuyžívající proprietárních frameworků.<br></br>Pokud nejsem v práci, jsem ve škole: škola tvoří druhou podstatnou část mého života. Jako student Unicorn University jsem zatím uspěl v předmětech jako například Architektura cloudových aplikací, Frontendové a backendové systémy nebo Matematická analýza a Diskrétní matematika.<br></br>Ve svém volném čase se věnuji rozvíjení svých frontendových a backendových schopností, hudbě a hraní videoher.",
      "href": "o-mne"
    },
    "Experience": {
      "title": "Zkušenosti",
      "href": "zkusenosti",
      "tabs": [
        {
          "title":"Frontend vývojář • Yolk Studio",
          "dateSpan": "Únor – Březen 2025",
          "description": "Implementoval frontendová řešení na server-side i client-side, vytvářel multijazyčné vstupní stránky.",
          "skills": ["NextJS", "React.js", "TypeScript", "TailwindCSS", "Asana"]
        },
        {
          "title":"Vývojář webových aplikací • eppTec",
          "dateSpan": "Září 2024 – Únor 2025",
          "description": "Navrhoval a vyvíjel frontendová řešení pro bankovní procesy v České spořitelně.Pomocí TypeScriptu jsem převáděl komplexní požadavky do funkčních a škálovatelných systémů.",
          "skills": ["TypeScript", "Analytické myšlení", "Bankovní procesy"]
        },
        {
          "title":"Frontend vývojář",
          "dateSpan": "Červen – Září 2024 • ka.soft",
          "description": "Vedl jsem návrh a vývoj zakázkových webových aplikací s důrazem na intuitivní UX/UI, responzivní frontend a bezproblémovou integraci s backendem. Řídil jsem celý vývojový cyklus a zajišťoval včasné dodání škálovatelných a přístupných řešení dle požadavků klientů.",
          "skills": ["React.js", "TypeScript", "TailwindCSS", "Vite"]
        }
      ]
    },
    "Projects": {
      "title": "Projekty",
      "content": "",
      "href": "projekty"
    }
  }
}