{
  "Metadata": {
    "title": "Jan Zdenek",
    "description": "An ambitious frontend developer with a keen eye for detail, strong analytical skills, and experience leading teams."
  },
  "Aside": {
    "name": "Jan Zdenek",
    "position": "Front-end Developer",
    "quote": "I create accessible, pixel-accurate frontend solutions for web and web applications."
  },
  "Main": {
    "About": {
      "title": "About me",
      "content": "I am an ambitious frontend developer with a keen eye for detail, strong analytical skills, and experience leading teams. I am career-driven and results-oriented, always striving to ensure my work has a real impact and is widely utilized.<br></br>Throughout my career, I have had the opportunity to develop software in various environments—from companies specializing in custom web applications to large corporations utilizing proprietary frameworks.<br></br>Beyond work, education is a key part of my life. As a student at Unicorn University, I have successfully completed courses such as Cloud Application Architecture, Frontend and Backend Systems, and Mathematical Analysis & Discrete Mathematics.<br></br>In my free time, I focus on improving my frontend and backend skills, making music, and playing video games.",
      "href": "about-me"
    },
    "Experience": {
      "title": "Experience",
      "href": "experience",
      "tabs": [
        {
          "title":"Front-end Developer • Yolk Studio",
          "dateSpan": "February 2025 – Present",
          "description": "Built responsive websites featuring engaging 3D animations, multilingual server-side translations, and seamless cross-browser compatibility.",
          "skills": ["Next.js", "React", "GraphQL", "TypeScript", "TailwindCSS"]
        },
        {
          "title":"Web-app developer • eppTec",
          "dateSpan": "September 2024 – February 2025",
          "description": "Designed and developed frontend solutions for banking processes at Česká spořitelna. Using TypeScript, I translated complex requirements into functional and scalable systems.",
          "skills": ["TypeScript", "Analytical thinking", "Bank processes"]
        },
        {
          "title":"Front-end Developer • ka.soft",
          "dateSpan": "June – September 2024",
          "description": "Designed and developed custom web applications, creating intuitive UX/UI designs, writing responsive, performance-optimized frontend code. Managed the full development lifecycle to deliver scalable, user-focused solutions on time.",
          "skills": ["React", "TypeScript", "TailwindCSS", "Vite"]
        }
      ],
      "link": {
        "title": "Get my full Résumé",
        "href": "/janZdenek_CV.pdf"
      }
    },
    "Projects": {
      "title": "Projects",
      "href": "projects"
    }
  }
}