{
  "Aside": {
    "name": "Jan Zdenek",
    "position": "Front-end Developer",
    "quote": "I create accessible, pixel-accurate frontend solutions for web and web applications."
  },
  "Main": {
    "About": {
      "title": "About me",
      "content": "I am an ambitious frontend developer with an eye for detail, strong analytical skills and experience in team management. I am career-driven and results-oriented, with a strong passion for making a real impact and leveraging my work.<br></br>In the past, I have had the opportunity to develop software across a wide range of environments – from companies providing custom web applications and websites to large corporations using proprietary frameworks.<br></br>When I'm not at work, I'm at school: school is the other major part of my life. As a student at Unicorn University, I have so far succeeded in courses such as Cloud Application Architecture, Frontend and Backend Systems, and Mathematical Analysis and Discrete Mathematics.<br></br>In my spare time, I spend my time developing my frontend and backend skills, playing music and video games",
      "href": "about-me"
    },
    "Experience": {
      "title": "Experience",
      "href": "experience",
      "tabs": [
        {
          "title":"Front-end Developer • Yolk Studio",
          "dateSpan": "February – March 2025",
          "description": "Implemented server-side and client-side frontend solutions, created multilingual landing pages.",
          "skills": ["NextJS", "React.js", "TypeScript", "TailwindCSS", "Asana"]
        },
        {
          "title":"Web-app developer • eppTec",
          "dateSpan": "September 2024 – February 2025",
          "description": "Designed and developed frontend solutions for banking processes at Česká spořitelna. Using TypeScript, I translated complex requirements into functional and scalable systems.",
          "skills": ["TypeScript", "Analytical thinking", "Bank processes"]
        },
        {
          "title":"Front-end Developer • ka.soft",
          "dateSpan": "June – September 2024",
          "description": "Designed and developed custom web applications, creating intuitive UX/UI designs, writing responsive, performance-optimized frontend code. Managed the full development lifecycle to deliver scalable, user-focused solutions on time.",
          "skills": ["React.js", "TypeScript", "TailwindCSS", "Vite"]
        }
      ]
    },
    "Projects": {
      "title": "Projects",
      "href": "projects"
    }
  }
}